---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.FilterElement
source: html/2b877c8e-2632-1d90-ab2f-16bf3891f8ea.htm
---
# FilterElement Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.